{
    "title": "tail.wind",
    "titleSec1": "tail",
    "titleSec2": ".",
    "titleSec3": "wind",
    "titleSec4": "partners",
    "introduction": "a boutique capital advisory services firm",
    "email": "info@tailwindpartners.co",
    "companyName": "TailWind Partners LLP",
    "linkedin": "https://www.linkedin.com/company/tailwindpartners",
    "facebook": "",
    "instagram": "",
    "contactNo": "+1 (213) 397-2191",
    "QnA": [
         {
            "ques": "Why Work With Us",
            "desc": " fundraising is a complex, multi-staged and time & resource consuming process often involving months of efforts. It requires as much art as it requires brute force. It is hard like lifting a heavy-weight and hard like solving a complex puzzle. However, this is also one of the most rewarding processes of raising capital in the growth phase of a company. With a unique blend of experience of having worked with venture capital funds as well as corporate VCs, we are favorably positioned to understand the concerns and make founders investment ready. Moreover, we are well networked with a number of funds across sectors, sizes, and stages enabling us to provide the best in class advice to our clients. "
        }, 
{
            "ques": "Who We Are",
            "desc": "we are a team of serial entrepreneurs, business consultants, and strategists who believe in startup founders, and their revolutionary ideas. Through Tailwind Partners, we deliver investment banking services and capital raising advisory to founders of early and growth stage startups, looking to raise private capital through equity or debt. We take pride in playing our part to help both the founders and investors that we work to succeed in this dynamic market unlike any other."
        },
        {
            "ques": "What We Do",
            "desc": "we are a bridge between passionate founders with great businesses and the investors who wish to fund them. our two sided network connects companies in the enterprise-tech, fin-tech and consumer-tech space looking for Seed to Series A with capital sources that comprise a mix of HNW individuals, angel collectives, family offices, VCs, and sector focused investment banks. for our founders, our advisory services center around understanding their needs and curating the proper network of investors that we believe will be best aligned with them both strategically and culturally. for our investors, we develop a deep understanding of what deals are most appropriate and appealing for them to ensure that each opportunity is worth their consideration for investment and partnership. "
        }

    ],
    "quote": "There is nothing better in the world than finding passionate founders with great ideas and helping them actualize their dreams"
}